
  <details>
  <summary>terraform/compartments - Terraform Plan Output (click to expand)</summary>
  
```
data.oci_identity_compartment.parent: Reading...
data.oci_identity_compartment.parent: Read complete after 0s [id=ocid1.compartment.oc1..aaaaaaaavjic26327yzpleqiu77qvfaxxjobtsuili265urpkh7ac63afo3q]
oci_identity_compartment.root: Refreshing state... [id=ocid1.compartment.oc1..aaaaaaaa5duoizz2qhnhvoxgzvlzw7rr2dsumwgjrat5fbmiyhguqa5a4rga]
oci_identity_compartment.core["open04"]: Refreshing state... [id=ocid1.compartment.oc1..aaaaaaaahgs6iriwxxwjupblopuvq3vrifddue27czldbhckfcfmqqtgdxda]
oci_identity_compartment.core["open03"]: Refreshing state... [id=ocid1.compartment.oc1..aaaaaaaabgar43elaej6bpf7xf76bojsaorefsxasmh4bfbkhgell5fmxtkq]
oci_identity_compartment.core["security"]: Refreshing state... [id=ocid1.compartment.oc1..aaaaaaaabsx33czqr2o3cw7gzz4jz7bnenkt64ka6uriks5jcxpeyqg3drza]
oci_identity_compartment.core["hub"]: Refreshing state... [id=ocid1.compartment.oc1..aaaaaaaaehidqylcim37575lpyf7tkm57t3i4khinigekxmisow4gddw5nga]
oci_identity_compartment.core["mgmt"]: Refreshing state... [id=ocid1.compartment.oc1..aaaaaaaa2ym6p6nnu6rhpatnkusgu2rbgemrj3ieywecqla5b43wscqf5kzq]
oci_identity_compartment.core["open01"]: Refreshing state... [id=ocid1.compartment.oc1..aaaaaaaahsyoyeatoqtb5fhsbcxkh6lewykcko5vt4ozv4nbcsmgdu2q3mfa]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # oci_identity_compartment.core["open05"] will be created
  + resource "oci_identity_compartment" "core" {
      + compartment_id = "ocid1.compartment.oc1..aaaaaaaa5duoizz2qhnhvoxgzvlzw7rr2dsumwgjrat5fbmiyhguqa5a4rga"
      + defined_tags   = (known after apply)
      + description    = "Operating Entity 05 Compartment for the OpenLZ Project"
      + enable_delete  = false
      + freeform_tags  = {
          + "Project"   = "OpenLZ"
          + "Team"      = "Industry Cloud"
          + "Terraform" = "true"
        }
      + id             = (known after apply)
      + inactive_state = (known after apply)
      + is_accessible  = (known after apply)
      + name           = "cmp-open05"
      + state          = (known after apply)
      + time_created   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ all_compartments      = {
      + cmp-open05   = {
          + compartment_id = "ocid1.compartment.oc1..aaaaaaaa5duoizz2qhnhvoxgzvlzw7rr2dsumwgjrat5fbmiyhguqa5a4rga"
          + defined_tags   = (known after apply)
          + description    = "Operating Entity 05 Compartment for the OpenLZ Project"
          + enable_delete  = false
          + freeform_tags  = {
              + Project   = "OpenLZ"
              + Team      = "Industry Cloud"
              + Terraform = "true"
            }
          + id             = (known after apply)
          + inactive_state = (known after apply)
          + is_accessible  = (known after apply)
          + name           = "cmp-open05"
          + state          = (known after apply)
          + time_created   = (known after apply)
          + timeouts       = null
        }
        # (6 unchanged attributes hidden)
    }

Warning: Value for undeclared variable

The root module does not declare a variable named "test" but a value was
found in file "terraform.tfvars.json". If you meant to use this value, add a
"variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan_output.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan_output.tfplan"

```
  </details>
